n5/src/Documents/LVITransfer/LVITransfer.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>LVITransfer</name>
  <registerRecords>AccountingRegister.General</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>DepartmentReceiver</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>EmployeeReceiver</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/InformationRegisters/Settings/Settings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Settings</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Value</name>
    <type>
      <types>Characteristic.Settings</types>
    </type>
  </resources>
  <dimensions>
    <name>Parameter</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Settings</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Enums/FormStatuses/FormStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FormStatuses</name>
  <enumValues>
    <name>Saved</name>
  </enumValues>
  <enumValues>
    <name>Waiting</name>
  </enumValues>
  <enumValues>
    <name>Unloaded</name>
  </enumValues>
  <enumValues>
    <name>Printed</name>
  </enumValues>
  <enumValues>
    <name>Submitted</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
  <enumValues>
    <name>Returned</name>
  </enumValues>
</mdclass:Enum>

n5/src/Documents/InvoiceRecord/InvoiceRecord.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InvoiceRecord</name>
  <basedOn>Document.Invoice</basedOn>
  <basedOn>Document.Transfer</basedOn>
  <basedOn>Document.LVITransfer</basedOn>
  <basedOn>Document.VendorReturn</basedOn>
  <basedOn>Document.Sale</basedOn>
  <basedOn>Document.WriteOff</basedOn>
  <basedOn>Document.Return</basedOn>
  <basedOn>Document.AdjustDebts</basedOn>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.RangeStatuses</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>AttachedDocuments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AttachmentRows</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DefinedType.InvoiceRecordBase</types>
    </type>
  </attributes>
  <attributes>
    <name>Carrier</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Delegated</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>DefinedType.SaleDescription</types>
    </type>
  </attributes>
  <attributes>
    <name>Dispatcher</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Driver</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstPageRows</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FormNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LoadingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>LoadingPoint</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneyDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneyNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneySeries</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>PrintBack</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Redirects</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>DefinedType.ReferenceSeries</types>
    </type>
  </attributes>
  <attributes>
    <name>ShowServices</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.FormStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Storekeeper</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Transfer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Print</types>
    </type>
  </attributes>
  <attributes>
    <name>UnloadingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>UnloadingPoint</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillSeries</name>
    <type>
      <types>DefinedType.ReferenceSeries</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Discounts</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Detail</name>
      <type>
        <types>DocumentRef.Payment</types>
        <types>DocumentRef.Invoice</types>
        <types>DocumentRef.Refund</types>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.Invoice</types>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.Refund</types>
        <types>DocumentRef.Debts</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>ExtraCharge</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.FixedAssets</types>
        <types>CatalogRef.Items</types>
        <types>CatalogRef.IntangibleAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>OtherInfo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>ProducerPrice</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Social</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>OtherInfo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/Documents/LVITransfer/Forms/Form/Module.bsl
&AtServer
var Copy;
&AtClient
var ItemsRow;
&AtServer
var Env;
&AtServer
var Base;
&AtServer
var InvoiceRecordExists;

// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	InvoiceRecords.Read ( ThisObject );
	updateChangesPermission ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure updateChangesPermission ()

	Constraints.ShowAccess ( ThisObject );

EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( isNew () ) then
		Copy = not Parameters.CopyingValue.IsEmpty ();
		DocumentForm.Init ( Object );
		fillNew ();
		updateChangesPermission ();
	endif;
	setAccount ();
	Options.SetAccuracy ( ThisObject, "ItemsQuantity, ItemsQuantityPkg" );
	Options.Company ( ThisObject, Object.Company );
	setLinks ();
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Function isNew ()
	
	return Object.Ref.IsEmpty ();
	
EndFunction

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|FormInvoice show filled ( InvoiceRecord );
	|NewInvoiceRecord show FormStatus = Enum.FormStatuses.Canceled or empty ( FormStatus );
	|Warning show ChangesDisallowed;
	|GroupItems Date Company Memo Number lock ChangesDisallowed;
	|ItemsCommandBar disable ChangesDisallowed;
	|Links show ShowLinks
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( Copy ) then
		return;
	endif; 
	Object.Company = Logins.Settings ( "Company" ).Company;
	
EndProcedure 

&AtServer
Procedure setAccount () 

	info = InformationRegisters.Settings.GetLast ( , new Structure ( "Parameter", ChartsOfCharacteristicTypes.Settings.LVIExploitationAccount ) );
	Account = info.Value;

EndProcedure

&AtServer
Procedure setLinks ()
	
	SQL.Init ( Env );
	sqlLinks ();
	if ( Env.Selection.Count () = 0 ) then
		ShowLinks = false;
	else
		Env.Q.SetParameter ( "Ref", Object.Ref );
		SQL.Perform ( Env );
		setURLPanel ();
	endif;

EndProcedure 

&AtServer
Procedure sqlLinks ()
	
	if ( isNew () ) then
		return;
	endif;
	InvoiceRecordExists = not InvoiceRecord.IsEmpty ();
	if ( InvoiceRecordExists ) then
		s = "
		|// #InvoiceRecords
		|select Documents.Ref as Document, Documents.Date as Date, Documents.Number as Number
		|from Document.InvoiceRecord as Documents
		|where Documents.Base = &Ref
		|and not Documents.DeletionMark
		|";
		Env.Selection.Add ( s );
	endif;
	
EndProcedure 

&AtServer
Procedure setURLPanel ()
	
	parts = new Array ();
	if ( not isNew () ) then
		if ( InvoiceRecordExists ) then
			parts.Add ( URLPanel.DocumentsToURL ( Env.InvoiceRecords, Metadata.Documents.InvoiceRecord ) );
		endif;
	endif;
	s = URLPanel.Build ( parts );
	if ( s = undefined ) then
		ShowLinks = false;
	else
		ShowLinks = true;
		Links = s;
	endif;
	Appearance.Apply ( ThisObject, "ShowLinks" );
	
EndProcedure 

&AtClient
Procedure BeforeWrite ( Cancel, WriteParameters )
	
	Forms.DeleteLastRow ( Object.Items, "Item" );
	
EndProcedure

&AtClient
Procedure NotificationProcessing ( EventName, Parameter, Source )
	
	if ( EventName = Enum.InvoiceRecordsWrite ()
		and Source.Ref = InvoiceRecord ) then
		readPrinted ();	
	elsif ( EventName = Enum.MessageChangesPermissionIsSaved ()
		and ( Parameter = Object.Ref
			or Parameter = BegOfDay ( Object.Date ) ) ) then
		updateChangesPermission ();
	endif;

EndProcedure

&AtServer
Procedure readPrinted ()
	
	InvoiceRecords.Read ( ThisObject );
	Appearance.Apply ( ThisObject, "FormStatus, ChangesDisallowed" );
	
EndProcedure

&AtServer
Procedure OnWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	if ( Object.Ref.IsEmpty () ) then
		return;
	endif;
	readPrinted ();
	Appearance.Apply ( ThisObject, "InvoiceRecord" );
	
EndProcedure

&AtClient
Procedure NewWriteProcessing ( NewObject, Source, StandardProcessing )
	
	readNewInvoice ( NewObject );
	
EndProcedure

&AtServer
Procedure readNewInvoice ( NewObject ) 

	type = TypeOf ( NewObject );
	if ( type = Type ( "DocumentRef.InvoiceRecord" ) ) then
		InvoiceRecords.Read ( ThisObject );
		setLinks ();
		Appearance.Apply ( ThisObject, "InvoiceRecord, ShowLinks, FormStatus, ChangesDisallowed" );
	endif;

EndProcedure

&AtClient
Procedure CompanyOnChange ( Item )
	
	Options.ApplyCompany ( ThisObject );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure DateOnChange ( Item )

	updateChangesPermission ();
	
EndProcedure

// *****************************************
// *********** Table Items

&AtClient
Procedure ItemsOnActivateRow ( Item )
	
	ItemsRow = Item.CurrentData;
	
EndProcedure

&AtClient
Procedure ItemOnChange ( Item )
	
	applyItem ();
	
EndProcedure

&AtClient
Procedure applyItem ()
	
	p = new Structure ();
	p.Insert ( "Date", Object.Date );
	p.Insert ( "Company", Object.Company );
	p.Insert ( "Item", ItemsRow.Item );
	data = getItemData ( p );
	ItemsRow.Package = data.Package;
	ItemsRow.Capacity = data.Capacity;
	ItemsRow.Account = Account;
	Computations.Units ( ItemsRow );
	
EndProcedure

&AtServerNoContext
Function getItemData ( val Params )
	
	data = DF.Values ( Params.Item, "Package, Package.Capacity as Capacity" );
	if ( data.Capacity = 0 ) then
		data.Capacity = 1;
	endif; 
	return data;
	
EndFunction 

&AtClient
Procedure PackageOnChange ( Item )

	applyPackage ();
	
EndProcedure

&AtClient
Procedure applyPackage ()
	
	p = new Structure ();
	p.Insert ( "Date", Object.Date );
	p.Insert ( "Item", ItemsRow.Item );
	p.Insert ( "Feature", ItemsRow.Feature );
	p.Insert ( "Package", ItemsRow.Package );
	data = getPackageData ( p );
	ItemsRow.Capacity = data.Capacity;
	Computations.Units ( ItemsRow );
	
EndProcedure

&AtServerNoContext
Function getPackageData ( val Params )
	
	capacity = DF.Pick ( Params.Package, "Capacity", 1 );
	data = new Structure ();
	data.Insert ( "Capacity", capacity );
	return data;
	
EndFunction 

&AtClient
Procedure QuantityPkgOnChange ( Item )
	
	Computations.Units ( ItemsRow );
	
EndProcedure

&AtClient
Procedure QuantityOnChange ( Item )
	
	Computations.Packages ( ItemsRow );
	
EndProcedure
